dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxDmu_bf.h
/**
 * \file IfxDmu_bf.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Dmu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Dmu_Registers
 * 
 */
#ifndef IFXDMU_BF_H
#define IFXDMU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Dmu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_OFF (24u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_OFF (0u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_OFF (1u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_OFF (2u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_OFF (3u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_OFF (20u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_OFF (21u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_OFF (7u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_LEN (1u)

