dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S58L */
#define IFX_DMU_HP_PROCON_P1_S58L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S59L */
#define IFX_DMU_HP_PROCON_P1_S59L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S59L */
#define IFX_DMU_HP_PROCON_P1_S59L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S59L */
#define IFX_DMU_HP_PROCON_P1_S59L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S60L */
#define IFX_DMU_HP_PROCON_P1_S60L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S60L */
#define IFX_DMU_HP_PROCON_P1_S60L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S60L */
#define IFX_DMU_HP_PROCON_P1_S60L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S61L */
#define IFX_DMU_HP_PROCON_P1_S61L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S61L */
#define IFX_DMU_HP_PROCON_P1_S61L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S61L */
#define IFX_DMU_HP_PROCON_P1_S61L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S62L */
#define IFX_DMU_HP_PROCON_P1_S62L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S62L */
#define IFX_DMU_HP_PROCON_P1_S62L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S62L */
#define IFX_DMU_HP_PROCON_P1_S62L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S63L */
#define IFX_DMU_HP_PROCON_P1_S63L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S63L */
#define IFX_DMU_HP_PROCON_P1_S63L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S63L */
#define IFX_DMU_HP_PROCON_P1_S63L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S64L */
#define IFX_DMU_HP_PROCON_P2_S64L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S64L */
#define IFX_DMU_HP_PROCON_P2_S64L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S64L */
#define IFX_DMU_HP_PROCON_P2_S64L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_MSK (0x1u)

